УТ_для_edt/src/Catalogs/смартКвалификацииМенеджеров/смартКвалификацииМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартКвалификацииМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 10.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <predefined>
    <items>
      <name>РегистрацияПользователяНаСайте</name>
      <description>Регистрация пользователя на сайте</description>
    </items>
  </predefined>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйЭтап</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВзаимодействияСКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.смартТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПродажиВПрошлыхПеридах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЛидовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #1748 смарт: Саломадин 05.04.2024 //Переход на единую воронку</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеТоваров</name>
    <comment>//++ #Б-1198 смарт: Фролов 24.10.2024 //Исключение некоторых квалификаций из условий обязательного указания товаров в ТЧ товары</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуальна</name>
    <comment>//++ #Б-4442 смарт: Фролов 30.09.2025 //Доработка механизма Квалификаций менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОценки</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВариантыОценкиОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификацияОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатуры</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиРассылок</name>
    <comment>//++ #1738 смарт: Фролов 02.04.2024 //Добавляем дополнительных получателей рассыки по квалификации.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартКвалификацииМенеджеров/Forms/ФормаКорректировкиКвалификаций/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартКвалификацииМенеджеровПользователи.Пользователь КАК Менеджер
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи КАК смартКвалификацииМенеджеровПользователи
	|ГДЕ
	|	НЕ смартКвалификацииМенеджеровПользователи.Ссылка.НеАктуальна
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартКвалификацииМенеджеровПользователи.Пользователь.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартКвалификацииМенеджеров.Ссылка КАК КвалификацияМенеджера,
	|	смартКвалификацииМенеджеров.Наименование КАК Заголовок
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров КАК смартКвалификацииМенеджеров
	|ГДЕ
	|	НЕ смартКвалификацииМенеджеров.НеАктуальна
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартКвалификацииМенеджеров.Сортировка,
	|	смартКвалификацииМенеджеров.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартКвалификацииМенеджеровПользователи.Ссылка КАК КвалификацияМенеджера,
	|	смартКвалификацииМенеджеровПользователи.Пользователь КАК Менеджер
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи КАК смартКвалификацииМенеджеровПользователи
	|ГДЕ
	|	НЕ смартКвалификацииМенеджеровПользователи.Ссылка.НеАктуальна");
	МасРезльтатов = Запрос.ВыполнитьПакет();
	
	ТабМенеджеров = МасРезльтатов[0].Выгрузить();
	ТабКвалификаций.Загрузить(МасРезльтатов[1].Выгрузить());
	Для Каждого СтрТабКвалификаций Из ТабКвалификаций Цикл
		СтрТабКвалификаций.ИмяКолонки = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
	КонецЦикла;
	
	ТабЗаполнения = МасРезльтатов[2].Выгрузить();
	КолонкиДобавляемые = Новый Массив;
	Для Каждого СтрТабКвалификаций Из ТабКвалификаций Цикл
		
		Если ЭтаФорма.Элементы.Найти("Квалификация_"+СтрТабКвалификаций.ИмяКолонки) = Неопределено ТОгда
			КолонкиДобавляемые.Добавить(Новый РеквизитФормы("Квалификация_" + СтрТабКвалификаций.ИмяКолонки, Новый ОписаниеТипов("Булево"), "ТаблицаМенеджеров", СтрТабКвалификаций.Заголовок));
			КолонкиДобавляемые.Добавить(Новый РеквизитФормы("ЗаголовокКвалификации_" + СтрТабКвалификаций.ИмяКолонки, Новый ОписаниеТипов("Строка"), "ТаблицаМенеджеров", СтрТабКвалификаций.Заголовок));
		КонецЕсли;
		
	КонецЦикла;	
	
	ИзменитьРеквизиты(КолонкиДобавляемые,);
	
	Для Каждого СтрТабКвалификаций Из ЭтаФорма.ТабКвалификаций Цикл
		
		НоваяГруппа = Элементы.Добавить("Группа_" + СтрТабКвалификаций.ИмяКолонки, Тип("ГруппаФормы"), ЭтаФорма.Элементы.ТаблицаМенеджеров);
		НоваяГруппа.Группировка = ГруппировкаКолонок.ВЯчейке;
		
		НовыйЗаголовок = Элементы.Добавить("ЗаголовокКолонки_" + СтрТабКвалификаций.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы["Группа_" + СтрТабКвалификаций.ИмяКолонки]);
		НовыйЗаголовок.ТолькоПросмотр = Истина;
		НовыйЗаголовок.ПутьКДанным = "ТаблицаМенеджеров" + "." + "ЗаголовокКвалификации_" + СтрТабКвалификаций.ИмяКолонки;
		НовыйЗаголовок.АвтоМаксимальнаяШирина = Ложь;
		НовыйЗаголовок.Ширина = 7;
		НовыйЗаголовок.МаксимальнаяШирина = 7;
		
		ДобавленнаяКвалификация = Элементы.Добавить("Колонка_" + СтрТабКвалификаций.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы["Группа_" + СтрТабКвалификаций.ИмяКолонки]);
		ДобавленнаяКвалификация.Вид = ВидПоляФормы.ПолеФлажка;
		ДобавленнаяКвалификация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ДобавленнаяКвалификация.ОтображатьВШапке = Ложь;
		ДобавленнаяКвалификация.ОтображатьВПодвале = Ложь;
		ДобавленнаяКвалификация.ПутьКДанным = "ТаблицаМенеджеров" + "." + "Квалификация_" + СтрТабКвалификаций.ИмяКолонки;
		ДобавленнаяКвалификация.Видимость = Истина;
		ДобавленнаяКвалификация.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров");
		ДобавленнаяКвалификация.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		ДобавленнаяКвалификация.УстановитьДействие("ПриИзменении", "ТаблицаМенеджеровПриИзменении");
		
	КонецЦикла;
	
	Для Каждого СтрТабМенеджеров Из ТабМенеджеров Цикл
		
		СтрТаблицаМенеджеров = ТаблицаМенеджеров.Добавить();
		СтрТаблицаМенеджеров.Менеджер = СтрТабМенеджеров.Менеджер;
		Для Каждого СтрТабКвалификаций Из ТабКвалификаций Цикл
			СтрокиТабЗаполнения = ТабЗаполнения.НайтиСтроки(Новый Структура("Менеджер,КвалификацияМенеджера",СтрТабМенеджеров.Менеджер,СтрТабКвалификаций.КвалификацияМенеджера));
			Если СтрокиТабЗаполнения.Количество() > 0 ТОгда
				СтрТаблицаМенеджеров["Квалификация_"+СтрТабКвалификаций.ИмяКолонки] = Истина;	
			КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров") ТОгда
		
		Элементы.ФормаЗакрыть.Доступность = Ложь;
		Элементы.ФормаСохранить.Доступность = Ложь;
		Элементы.ФормаСохранитьИЗакрыть.Доступность = Ложь;
		Элементы.ТаблицаМенеджеровПодборМенеджеров.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаМенеджеровПриИзменении(Элемент)
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФормаЗакрыть(Команда)
	
	Если ЭтаФорма.Модифицированность ТОгда
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("смартПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Данные были изменены, сохранить изменения квалификаций?", Режим, 0);
	Иначе	
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Для Каждого СтрТабКвалификаций Из ТабКвалификаций Цикл
		
		ОбКвалификация = СтрТабКвалификаций.КвалификацияМенеджера.ПолучитьОбъект();
		ОбКвалификация.Пользователи.Очистить();
		
		Для Каждого СтрТаблицаМенеджеров Из ТаблицаМенеджеров Цикл
			
			Если СтрТаблицаМенеджеров["Квалификация_" + СтрТабКвалификаций.ИмяКолонки] ТОгда
				
				СтрПользователи=ОбКвалификация.Пользователи.Добавить();	
				СтрПользователи.Пользователь = СтрТаблицаМенеджеров.Менеджер;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбКвалификация.Записать();
		
		ТаблицаДляКоэффициентов = смартСервер.СформироватьВыдачуЛидовПоКвалификации(ОбКвалификация.Ссылка);
		
		смартСервер.ЗаполнитьКоэффициентыМенеджеров(ТаблицаДляКоэффициентов);

	КонецЦикла;
	
	смартСервер.ОчиститьКоэффициентыИВыдачуЛидов();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура смартПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
		ЭтаФорма.Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда	
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборМенеджеров(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",		Ложь);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.Заголовок = "Подбор пользователей" Тогда
		СтрокиТаблицаМенеджеров = ЭтаФорма.ТаблицаМенеджеров.НайтиСтроки(Новый Структура("Менеджер",ВыбранноеЗначение));
		Если СтрокиТаблицаМенеджеров.Количество() = 0 Тогда
			СтрТаблицаМенеджеров = ТаблицаМенеджеров.Добавить();	
			СтрТаблицаМенеджеров.Менеджер = ВыбранноеЗначение;
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
